RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Include/gd32f5xx_timer.h
/* bits definitions */
/* TIMER_CTL0 */
#define TIMER_CTL0_CEN                   BIT(0)                                 /*!< TIMER counter enable */
#define TIMER_CTL0_UPDIS                 BIT(1)                                 /*!< update disable */
#define TIMER_CTL0_UPS                   BIT(2)                                 /*!< update source */
#define TIMER_CTL0_SPM                   BIT(3)                                 /*!< single pulse mode */
#define TIMER_CTL0_DIR                   BIT(4)                                 /*!< timer counter direction */
#define TIMER_CTL0_CAM                   BITS(5,6)                              /*!< center-aligned mode selection */
#define TIMER_CTL0_ARSE                  BIT(7)                                 /*!< auto-reload shadow enable */
#define TIMER_CTL0_CKDIV                 BITS(8,9)                              /*!< clock division */

/* TIMER_CTL1 */
#define TIMER_CTL1_CCSE                  BIT(0)                                 /*!< commutation control shadow enable */
#define TIMER_CTL1_CCUC                  BIT(2)                                 /*!< commutation control shadow register update control */
#define TIMER_CTL1_DMAS                  BIT(3)                                 /*!< DMA request source selection */
#define TIMER_CTL1_MMC                   BITS(4,6)                              /*!< master mode control */
#define TIMER_CTL1_TI0S                  BIT(7)                                 /*!< channel 0 trigger input selection(hall mode selection) */
#define TIMER_CTL1_ISO0                  BIT(8)                                 /*!< idle state of channel 0 output */
#define TIMER_CTL1_ISO0N                 BIT(9)                                 /*!< idle state of channel 0 complementary output */
#define TIMER_CTL1_ISO1                  BIT(10)                                /*!< idle state of channel 1 output */
#define TIMER_CTL1_ISO1N                 BIT(11)                                /*!< idle state of channel 1 complementary output */
#define TIMER_CTL1_ISO2                  BIT(12)                                /*!< idle state of channel 2 output */
#define TIMER_CTL1_ISO2N                 BIT(13)                                /*!< idle state of channel 2 complementary output */
#define TIMER_CTL1_ISO3                  BIT(14)                                /*!< idle state of channel 3 output */
#define TIMER_CTL1_ISO3N                 BIT(15)                                /*!< idle state of channel 3 complementary output */

/* TIMER_SMCFG */
#define TIMER_SMCFG_SMC                  BITS(0,2)                              /*!< slave mode control */
#define TIMER_SMCFG_TRGS                 BITS(4,6)                              /*!< trigger selection */
#define TIMER_SMCFG_MSM                  BIT(7)                                 /*!< master-slave mode */
#define TIMER_SMCFG_ETFC                 BITS(8,11)                             /*!< external trigger filter control */
#define TIMER_SMCFG_ETPSC                BITS(12,13)                            /*!< external trigger prescaler */
#define TIMER_SMCFG_SMC1                 BIT(14)                                /*!< part of SMC for enable external clock mode 1 */
#define TIMER_SMCFG_ETP                  BIT(15)                                /*!< external trigger polarity */

/* TIMER_DMAINTEN */
#define TIMER_DMAINTEN_UPIE              BIT(0)                                 /*!< update interrupt enable */
#define TIMER_DMAINTEN_CH0IE             BIT(1)                                 /*!< channel 0 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH1IE             BIT(2)                                 /*!< channel 1 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH2IE             BIT(3)                                 /*!< channel 2 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH3IE             BIT(4)                                 /*!< channel 3 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CMTIE             BIT(5)                                 /*!< commutation interrupt request enable */
#define TIMER_DMAINTEN_TRGIE             BIT(6)                                 /*!< trigger interrupt enable */
#define TIMER_DMAINTEN_BRKIE             BIT(7)                                 /*!< break interrupt enable */
#define TIMER_DMAINTEN_UPDEN             BIT(8)                                 /*!< update DMA request enable */
#define TIMER_DMAINTEN_CH0DEN            BIT(9)                                 /*!< channel 0 DMA request enable */
#define TIMER_DMAINTEN_CH1DEN            BIT(10)                                /*!< channel 1 DMA request enable */
#define TIMER_DMAINTEN_CH2DEN            BIT(11)                                /*!< channel 2 DMA request enable */
#define TIMER_DMAINTEN_CH3DEN            BIT(12)                                /*!< channel 3 DMA request enable */
#define TIMER_DMAINTEN_CMTDEN            BIT(13)                                /*!< commutation DMA request enable */
#define TIMER_DMAINTEN_TRGDEN            BIT(14)                                /*!< trigger DMA request enable */
#define TIMER_DMAINTEN_CH0COMADDIE       BIT(28)                                /*!< channel 0 additional compare interrupt enable */
#define TIMER_DMAINTEN_CH1COMADDIE       BIT(29)                                /*!< channel 1 additional compare interrupt enable */
#define TIMER_DMAINTEN_CH2COMADDIE       BIT(30)                                /*!< channel 2 additional compare interrupt enable */
#define TIMER_DMAINTEN_CH3COMADDIE       BIT(31)                                /*!< channel 3 additional compare interrupt enable */

/* TIMER_INTF */
#define TIMER_INTF_UPIF                  BIT(0)                                 /*!< update interrupt flag */
#define TIMER_INTF_CH0IF                 BIT(1)                                 /*!< channel 0 capture/compare interrupt flag */
#define TIMER_INTF_CH1IF                 BIT(2)                                 /*!< channel 1 capture/compare interrupt flag */
#define TIMER_INTF_CH2IF                 BIT(3)                                 /*!< channel 2 capture/compare interrupt flag */
#define TIMER_INTF_CH3IF                 BIT(4)                                 /*!< channel 3 capture/compare interrupt flag */
#define TIMER_INTF_CMTIF                 BIT(5)                                 /*!< channel commutation interrupt flag */
#define TIMER_INTF_TRGIF                 BIT(6)                                 /*!< trigger interrupt flag */
#define TIMER_INTF_BRKIF                 BIT(7)                                 /*!< break interrupt flag */
#define TIMER_INTF_CH0OF                 BIT(9)                                 /*!< channel 0 overcapture flag */
#define TIMER_INTF_CH1OF                 BIT(10)                                /*!< channel 1 overcapture flag */
#define TIMER_INTF_CH2OF                 BIT(11)                                /*!< channel 2 overcapture flag */
#define TIMER_INTF_CH3OF                 BIT(12)                                /*!< channel 3 overcapture flag */
#define TIMER_INTF_CH0COMADDIF           BIT(28)                                /*!< channel 0 additional compare interrupt flag */
#define TIMER_INTF_CH1COMADDIF           BIT(29)                                /*!< channel 1 additional compare interrupt flag */
#define TIMER_INTF_CH2COMADDIF           BIT(30)                                /*!< channel 2 additional compare interrupt flag */
#define TIMER_INTF_CH3COMADDIF           BIT(31)                                /*!< channel 3 additional compare interrupt flag */

